Repository: bear3283/PrayAnswer
Catalog: PrayAnswer/*.lproj/Localizable.strings
Languages: es, ko

# tab.prayer_list
source: Prayer List
es: Lista de Oraciones
ko: 기도 목록

# tab.add_prayer
source: Add Prayer
es: Agregar Oración
ko: 기도 추가

# tab.people
source: People
es: Personas
ko: 기도대상자

# nav.prayer_list
source: Prayer List
es: Lista de Oraciones
ko: 기도 목록

# nav.new_prayer
source: New Prayer
es: Nueva Oración
ko: 새로운 기도

# nav.prayer_detail
source: Prayer Detail
es: Detalle de Oración
ko: 기도 상세

# nav.prayer_edit
source: Edit Prayer
es: Editar Oración
ko: 기도 편집

# nav.people_list
source: People
es: Personas
ko: 기도대상자

# nav.storage_move
source: Move Storage
es: Mover Almacén
ko: 보관소 이동

# button.save
source: Save
es: Guardar
ko: 저장

# button.edit
source: Edit
es: Editar
ko: 편집

# button.delete
source: Delete
es: Eliminar
ko: 삭제

# button.done
source: Done
es: Listo
ko: 완료

# button.cancel
source: Cancel
es: Cancelar
ko: 취소

# button.save_prayer
source: Save Prayer
es: Guardar Oración
ko: 기도 저장하기

# button.move_storage
source: Move Storage
es: Mover Almacén
ko: 보관소 이동

# label.title
source: Title
es: Título
ko: 제목

# label.prayer_content
source: Prayer Content
es: Contenido de la Oración
ko: 기도 내용

# label.category
source: Category
es: Categoría
ko: 카테고리

# label.prayer_target
source: Prayer Target
es: Destinatario de la Oración
ko: 기도 대상자

# label.classification
source: Classification
es: Clasificación
ko: 분류

# placeholder.title
source: Enter prayer title
es: Ingrese el título de la oración
ko: 기도 제목을 입력하세요

# placeholder.content
source: Write your prayer with heart
es: Escriba su oración con el corazón
ko: 마음을 담아 기도 내용을 작성하세요

# placeholder.target
source: Prayer Target (Optional)
es: Destinatario de la Oración (Opcional)
ko: 기도 대상자 (선택사항)

# placeholder.search_people
source: Search People
es: Buscar Personas
ko: 기도대상자 검색

# storage.wait.description
source: Prayers waiting for an answer.
es: Oraciones esperando respuesta.
ko: 응답을 기다리는 기도입니다.

# storage.yes.description
source: Prayers that have been answered.
es: Oraciones respondidas.
ko: 응답받은 기도입니다.

# storage.no.description
source: Prayers not yet answered.
es: Oraciones aún sin respuesta.
ko: 아직 응답받지 못한 기도입니다.

# category.family
source: Family
es: Familia
ko: 가족

# category.health
source: Health
es: Salud
ko: 건강

# category.work
source: Work/Study
es: Trabajo/Estudios
ko: 일/학업

# category.relationship
source: Relationship
es: Relaciones
ko: 인간관계

# category.thanksgiving
source: Thanksgiving
es: Acción de Gracias
ko: 감사

# category.vision
source: Vision
es: Visión
ko: 비전

# category.other
source: Other
es: Otro
ko: 기타

# info.prayer_info
source: Prayer Info
es: Información de Oración
ko: 기도 정보

# info.created_date
source: Created
es: Creado
ko: 생성일

# info.modified_date
source: Modified
es: Modificado
ko: 수정일

# info.moved_date
source: Moved
es: Movido
ko: 이동일

# info.recent_prayer
source: Recent Prayer
es: Oración Reciente
ko: 최근 기도

# info.save_notice
source: Save Notice
es: Aviso de Guardado
ko: 저장 안내

# info.save_description
source: Prayer will be saved in 'Wait' storage
es: La oración se guardará en el almacén 'Espera'
ko: 기도는 '대기중' 보관소에 저장됩니다

# empty.storage_title
source: Storage is Empty
es: El Almacén Está Vacío
ko: 보관소가 비어있습니다

# empty.people_title
source: No People
es: No Hay Personas
ko: 기도대상자가 없습니다

# empty.people_description
source: When you add a prayer target, they will appear here
es: Cuando agregue un destinatario de oración, aparecerán aquí
ko: 기도를 추가할 때 기도대상자를 입력하면 여기서 확인할 수 있습니다

# alert.notification
source: Notice
es: Aviso
ko: 알림

# alert.save_complete
source: Save Complete
es: Guardado Completo
ko: 저장 완료

# alert.delete_prayer
source: Delete Prayer
es: Eliminar Oración
ko: 기도 삭제

# success.save_message
source: Prayer saved successfully. Moving to prayer list.
es: Oración guardada exitosamente. Moviendo a la lista de oraciones.
ko: 기도가 성공적으로 저장되었습니다. 기도 목록으로 이동합니다.

# error.empty_fields
source: Please enter both title and content.
es: Por favor ingrese título y contenido.
ko: 제목과 내용을 모두 입력해주세요.

# error.title_too_long
source: Title cannot exceed 100 characters.
es: El título no puede exceder 100 caracteres.
ko: 제목은 100자를 초과할 수 없습니다.

# error.content_too_long
source: Prayer content cannot exceed 2000 characters.
es: El contenido de la oración no puede exceder 2000 caracteres.
ko: 기도 내용은 2000자를 초과할 수 없습니다.

# error.save_failed
source: An error occurred while saving the prayer. Please try again.
es: Ocurrió un error al guardar la oración. Por favor intente de nuevo.
ko: 기도를 저장하는 중 오류가 발생했습니다. 다시 시도해주세요.

# error.delete_failed
source: An error occurred during deletion.
es: Ocurrió un error durante la eliminación.
ko: 삭제 중 오류가 발생했습니다.

# error.delete_prayer_failed
source: An error occurred while deleting the prayer.
es: Ocurrió un error al eliminar la oración.
ko: 기도를 삭제하는 중 오류가 발생했습니다.

# error.update_failed
source: An error occurred during update.
es: Ocurrió un error durante la actualización.
ko: 수정 중 오류가 발생했습니다.

# error.update_prayer_failed
source: An error occurred while updating the prayer.
es: Ocurrió un error al actualizar la oración.
ko: 기도를 수정하는 중 오류가 발생했습니다.

# error.move_failed
source: An error occurred while moving storage.
es: Ocurrió un error al mover el almacén.
ko: 보관소 이동 중 오류가 발생했습니다.

# error.move_prayer_failed
source: An error occurred while moving the prayer.
es: Ocurrió un error al mover la oración.
ko: 기도를 이동하는 중 오류가 발생했습니다.

# error.favorite_failed
source: An error occurred while changing favorite.
es: Ocurrió un error al cambiar favorito.
ko: 즐겨찾기 변경 중 오류가 발생했습니다.

# error.favorite_toggle_failed
source: An error occurred while toggling favorite.
es: Ocurrió un error al alternar favorito.
ko: 즐겨찾기를 변경하는 중 오류가 발생했습니다.

# error.generic
source: An error occurred while saving. Please try again.
es: Ocurrió un error al guardar. Por favor intente de nuevo.
ko: 저장 중 오류가 발생했습니다. 다시 시도해주세요.

# confirm.delete_prayer
source: Are you sure you want to delete this prayer? This action cannot be undone.
es: ¿Está seguro de que desea eliminar esta oración? Esta acción no se puede deshacer.
ko: 이 기도를 삭제하시겠습니까? 이 작업은 되돌릴 수 없습니다.

# accessibility.favorite
source: Favorite
es: Favorito
ko: 즐겨찾기

# accessibility.favorite_add
source: Add to Favorites
es: Agregar a Favoritos
ko: 즐겨찾기에 추가

# accessibility.favorite_remove
source: Remove from Favorites
es: Quitar de Favoritos
ko: 즐겨찾기에서 제거

# accessibility.favorite_add_hint
source: Tap to add to favorites
es: Toque para agregar a favoritos
ko: 탭하여 즐겨찾기에 추가하세요

# accessibility.favorite_remove_hint
source: Tap to remove from favorites
es: Toque para quitar de favoritos
ko: 탭하여 즐겨찾기에서 제거하세요

# accessibility.tap_detail
source: Tap to view details
es: Toque para ver detalles
ko: 탭하여 상세 보기

# accessibility.storage_format
source: %@ storage, %d prayers
es: almacén %@, %d oraciones
ko: %@ 보관소, %d개의 기도

# accessibility.select_storage
source: Select to view prayers in %@ storage
es: Seleccione para ver oraciones en almacén %@
ko: 선택하여 %@ 보관소의 기도들을 확인하세요

# accessibility.prayer_format
source: %@, %@ category, %@ storage%@
es: %@, categoría %@, almacén %@%@
ko: %@, %@ 카테고리, %@ 보관소%@

# date.recent_prayer_format
source: Recent prayer: %@
es: Oración reciente: %@
ko: 최근 기도: %@

# storage_picker.title
source: Move Storage
es: Mover Almacén
ko: 보관소 이동

# storage_picker.description
source: Select storage to move to
es: Seleccione el almacén al que mover
ko: 이동할 보관소를 선택하세요

# validation.title_required
source: Title is required
es: Se requiere título
ko: 제목이 필요합니다

# validation.content_required
source: Prayer content is required
es: Se requiere contenido de oración
ko: 기도 내용이 필요합니다

# target.myself
source: Myself
es: Yo mismo
ko: 본인

# target.select_target
source: Select Prayer Target
es: Seleccionar Destinatario
ko: 기도대상자 선택

# target.add_new
source: Add New Target
es: Agregar Nuevo Destinatario
ko: 새 대상자 추가

# target.new_placeholder
source: Enter new target name
es: Ingrese nombre del destinatario
ko: 새 대상자 이름 입력

# target.title_format
source: %@ Prayer for %@
es: Oración de %@ para %@
ko: %@을(를) 위한 %@ 기도

# target.prayer_for_format
source: Prayer for %@
es: Oración para %@
ko: %@을(를) 위한 기도

# dday.title
source: D-Day
es: Día D

# dday.set_target_date
source: Set Target Date
es: Establecer Fecha Objetivo
ko: 목표 날짜 설정

# dday.target_date
source: Target Date
es: Fecha Objetivo
ko: 목표 날짜

# dday.enable_notification
source: Enable Notifications
es: Activar Notificaciones
ko: 알림 받기

# dday.notification_description
source: Receive notifications on D-7, D-3, D-1, and D-Day
es: Recibir notificaciones en D-7, D-3, D-1 y Día D
ko: D-7, D-3, D-1, D-Day에 알림을 받습니다

# dday.clear_date
source: Clear Date
es: Borrar Fecha
ko: 날짜 삭제

# dday.today
source: Today is D-Day
es: Hoy es el Día D
ko: 오늘이 D-Day입니다

# dday.approaching
source: D-Day is approaching
es: El Día D se acerca
ko: D-Day가 다가오고 있습니다

# dday.passed
source: D-Day has passed
es: El Día D ha pasado
ko: D-Day가 지났습니다

# dday.notification_title
source: Prayer Reminder
es: Recordatorio de Oración
ko: 기도 알림

# dday.notification_dday_title
source: Today is D-Day!
es: ¡Hoy es el Día D!
ko: 오늘이 D-Day입니다!

# dday.notification_week_before
source: One week until D-Day for prayer for %@
es: Una semana hasta el Día D para la oración por %@
ko: %@을(를) 위한 기도 D-Day까지 일주일 남았습니다

# dday.notification_3days_before
source: 3 days until D-Day for prayer for %@
es: 3 días hasta el Día D para la oración por %@
ko: %@을(를) 위한 기도 D-Day까지 3일 남았습니다

# dday.notification_1day_before
source: Tomorrow is D-Day for prayer for %@
es: Mañana es el Día D para la oración por %@
ko: %@을(를) 위한 기도 D-Day가 내일입니다

# dday.notification_dday
source: Today is D-Day for prayer for %@. Send your prayers!
es: Hoy es el Día D para la oración por %@. ¡Envía tus oraciones!
ko: %@을(를) 위한 기도 D-Day입니다. 기도로 응원해주세요!

# dday.notification_generic
source: %d days until D-Day for prayer for %@
es: %d días hasta el Día D para la oración por %@
ko: %@을(를) 위한 기도 D-Day까지 %d일 남았습니다

# image.attach_image
source: Attach Image
es: Adjuntar Imagen

# image.attached_image
source: Attached Image
es: Imagen Adjunta

# image.select_image
source: Select Image
es: Seleccionar Imagen

# image.change_image
source: Change Image
es: Cambiar Imagen

# image.remove_image
source: Remove Image
es: Eliminar Imagen

# image.extract_text
source: Extract Text
es: Extraer Texto

# image.extracting_text
source: Extracting text...
es: Extrayendo texto...

# image.extracted_text
source: Extracted Text
es: Texto Extraído

# image.ocr_result
source: Text Extraction Result
es: Resultado de Extracción

# image.ocr_result_description
source: You can edit the extracted text from the image
es: Puede editar el texto extraído de la imagen

# image.apply_to_content
source: Apply to Prayer Content
es: Aplicar al Contenido

# image.edit_extracted_text
source: Edit Extracted Text
es: Editar Texto Extraído

# image.ai_organize
source: Organize with AI
es: Organizar con IA

# image.ai_organizing
source: AI is organizing...
es: IA organizando...

# image.error_directory_creation
source: Unable to create image storage folder
es: No se puede crear la carpeta de imágenes

# image.error_save_failed
source: Failed to save image
es: Error al guardar la imagen

# image.error_load_failed
source: Unable to load image
es: No se puede cargar la imagen

# image.error_delete_failed
source: Failed to delete image
es: Error al eliminar la imagen

# image.error_invalid_image
source: Invalid image
es: Imagen no válida

# image.error_ocr_failed
source: Failed to extract text
es: Error al extraer texto

# image.error_no_text_found
source: No text found in image
es: No se encontró texto en la imagen

# image.accessibility_attached_image
source: Attached image
es: Imagen adjunta

# image.accessibility_select_image
source: Tap to select an image
es: Toque para seleccionar una imagen

# image.accessibility_extract_text
source: Tap to extract text from image
es: Toque para extraer texto de la imagen

# voice.recording
source: Recording...
es: Grabando...
ko: 녹음 중...

# voice.listening
source: Listening...
es: Escuchando...
ko: 듣고 있습니다...

# voice.tap_to_start
source: Tap to start voice input
es: Toque para iniciar entrada de voz
ko: 탭하여 음성 입력 시작

# voice.tap_to_stop
source: Tap to stop recording
es: Toque para detener la grabación
ko: 탭하여 녹음 중지

# voice.start_recording
source: Start Recording
es: Iniciar Grabación
ko: 녹음 시작

# voice.stop_recording
source: Stop Recording
es: Detener Grabación
ko: 녹음 중지

# voice.use_text
source: Use Text
es: Usar Texto
ko: 텍스트 사용

# voice.cancel
source: Cancel
es: Cancelar
ko: 취소

# voice.retry
source: Retry
es: Reintentar
ko: 다시 시도

# voice.permission_required
source: Permission Required
es: Permiso Requerido
ko: 권한 필요

# voice.microphone_permission
source: Microphone access is required for voice input.
es: Se requiere acceso al micrófono para entrada de voz.
ko: 음성 입력을 위해 마이크 접근 권한이 필요합니다.

# voice.speech_permission
source: Speech recognition permission is required to convert voice to text.
es: Se requiere permiso de reconocimiento de voz para convertir voz a texto.
ko: 음성을 텍스트로 변환하기 위해 음성 인식 권한이 필요합니다.

# voice.open_settings
source: Open Settings
es: Abrir Configuración
ko: 설정 열기

# voice.error_recording_failed
source: Unable to start recording.
es: No se puede iniciar la grabación.
ko: 녹음을 시작할 수 없습니다.

# voice.error_recognizer_unavailable
source: Speech recognition is unavailable.
es: El reconocimiento de voz no está disponible.
ko: 음성 인식을 사용할 수 없습니다.

# voice.error_request_failed
source: Speech recognition request failed.
es: La solicitud de reconocimiento de voz falló.
ko: 음성 인식 요청에 실패했습니다.

# voice.error_permission_denied
source: Microphone or speech recognition permission denied.
es: Permiso de micrófono o reconocimiento de voz denegado.
ko: 마이크 또는 음성 인식 권한이 거부되었습니다.

# voice.error_audio_session
source: Unable to start audio session.
es: No se puede iniciar la sesión de audio.
ko: 오디오 세션을 시작할 수 없습니다.

# voice.error_no_text
source: No text recognized.
es: No se reconoció ningún texto.
ko: 인식된 텍스트가 없습니다.

# voice.accessibility_microphone
source: Enter prayer content by voice
es: Ingrese contenido de oración por voz
ko: 음성으로 기도 내용 입력

# voice.accessibility_recording_hint
source: Tap to start or stop voice recording
es: Toque para iniciar o detener la grabación de voz
ko: 탭하여 음성 녹음을 시작하거나 중지합니다

# attachment.section_title
source: Attachments
es: Adjuntos

# attachment.add_attachment
source: Add images or files
es: Agregar imágenes o archivos

# attachment.add_image
source: Add Photo
es: Añadir foto

# attachment.add_file
source: Add File
es: Añadir archivo

# attachment.remove
source: Remove
es: Eliminar

# attachment.extract_all_text
source: Extract All Text
es: Extraer todo el texto

# attachment.type_image
source: Image
es: Imagen

# attachment.max_reached
source: Maximum Attachments Reached
es: Máximo de adjuntos alcanzado

# attachment.max_reached_message
source: You can attach up to %d items
es: Puede adjuntar hasta %d elementos

# attachment.file_too_large
source: File size exceeds 20MB limit
es: El tamaño del archivo supera el límite de 20MB

# attachment.count_format
source: %d items
es: %d elementos

# attachment.error_invalid_document
source: Invalid document
es: Documento no válido

# attachment.error_unsupported_format
source: Unsupported file format
es: Formato de archivo no compatible

# button.confirm
source: OK
ko: 확인

# category.personal
source: Personal
ko: 개인

# alert.error
source: Error
ko: 오류

# counter.total_format
source: %d
ko: %d개

# target.search_or_add_placeholder
source: Search or add new target
ko: 이름 검색 또는 새 대상자 추가

# target.add_as_new
source: Add as new target
ko: 새 대상자로 추가
